In [1]:
import sqlite3 as db
import pandas as pd

In [4]:
conn = db.connect('banco.db')
cursor = conn.cursor()

In [5]:
cursor.execute(" create table aluno( id_aluno integer not null primary key autoincrement,nome_aluno varchar(50) not null,cpf_aluno varchar(12) not null,id_turma int not null )")

OperationalError: table aluno already exists

In [4]:
cursor.execute("create table turma(id_turma  int primary key,qtd_alunos int)")

In [6]:
cursor.execute( 'INSERT INTO aluno (nome_aluno, cpf_aluno, id_turma) VALUES ("João Silva", "12345678901", 1),("Maria Santos", "23456789012", 1), ("Pedro Costa", "34567890123", 1),("Ana Oliveira", "45678901234", 1), ("Rafael Souza", "56789012345", 1),("Lucas Mendes", "12345098765", 1)')

In [10]:
conn.commit()

In [9]:
cursor.execute("insert into turma (id_turma,qtd_alunos) values (1,34)")

In [5]:
df_innerJoin = pd.read_sql_query ("select   aluno.nome_aluno ,turma.qtd_alunos,turma.id_turma from aluno inner join turma where turma.id_turma = aluno.id_turma;",conn)

In [6]:
print(df_innerJoin)

     nome_aluno  qtd_alunos  id_turma
0    João Silva          34         1
1  Maria Santos          34         1
2   Pedro Costa          34         1
3  Ana Oliveira          34         1
4  Rafael Souza          34         1
5  Lucas Mendes          34         1

In [7]:
cursor.execute('select  max(id_aluno) from aluno')

quantAluno = cursor.fetchall()[0]

print("Nessa turma temos: "+str(quantAluno).strip("[] () ,")+" alunos" )

cursor.execute('select  qtd_alunos from turma')
maxQtdAlunos = cursor.fetchall()[0]
dif =  maxQtdAlunos[0] - quantAluno[0]
print("Logo temos " + str(dif)+ " vagas restantes")

Nessa turma temos: 6 alunos
Logo temos 28 vagas restantes